<?php

header('Content-type: text/html; charset=utf-8');

$lang = "";

if(isset($_COOKIE["pref_lang"])){
	$lang = $_COOKIE["pref_lang"];
}

if(($lang != "ru") && ($lang != "fr")){
	$lang = "ru";
}

require_once 'lang_'.$lang.'.php';

// parse parameters

$s = "";
if(isset($_GET["s"])) $s = $_GET["s"];

echo "<h2>Результат поска слова &quot;$s&quot;</h2>";
echo "<table border=1 width='100%'>";

preg_match("/^.*(.)$/u", $s, $last);
//var_dump($last);
//echo $sogl;
if (preg_match("/^.*(.)$/u", $s, $last))
if ($handle = opendir('../text_db/')) {
    $sogl = 0;
    if(preg_match("/$last[1]/u", "бвгджзйклмнҥҕпрстфхһцчшщ")) $sogl = 1;
    while (false !== ($entry = readdir($handle))) {
        if($entry == '.' || $entry == '..') continue;
        $fhandle = fopen("../text_db/$entry", "r");
        if ($fhandle) {
                $descr = fgets($fhandle, 8196);
		$text = "";
		while (($buffer = fgets($fhandle, 4096)) !== false) {
			if(preg_match("/^# /", $buffer)) continue; // ignore comments
			$arr = preg_split("/[\s,:()]+/", $buffer);
			foreach ($arr as $k => $word){
				$word = mb_strtolower($word, 'UTF-8');
				if(!preg_match("/^$s/", $word)){ continue; }
				// Основной падеж
        			if(preg_match("/^$s$/", $word)){
					$text = "$text<br>$buffer";
					break;
				}
				$found = 0;
				if(!$sogl){
					// после гласных
					// м, ҥ, та, тэ, то, тө
					if(preg_match("/^$s(м|ҥ|та|тэ|то|тө)$/u", $word)) { 
						$text = "$text<br>$buffer";
						break;
					}
				}else{
					// после согласных
					// ым, им, ум, үм, // ыҥ, иҥ, уҥ, үҥ, // а, э, о, ө
					if(preg_match("/^$s(ым|им|ум|үм|ыҥ|иҥ|уҥ|үҥ|а|э|о|ө)$/u", $word)) { 
						$text = "$text<br>$buffer";
						break;
					}
				}
					// после гласных, й, л, р	-быт (-бит, -бут, -бүт)
				if((!$sogl || preg_match("/$last[1]/u", "йлр")) && 
				   preg_match("/^$s(быт|бит|бут|бүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после к, п, с, т, х		-пыт (-пит, -пут, -пүт)
				if(preg_match("/$last[1]/u", "кпстх") && 
				   preg_match("/^$s(пыт|пит|пут|пүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после м, н, ҥ		-мыт (-мит, -мут, -мүт)
				if(preg_match("/$last[1]/u", "мнҥ") && 
				   preg_match("/^$s(мыт|мит|мут|мүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					
					// после а, э, о, ө		-ҕыт (-ҕит, -ҕут, -ҕүт)
				if(preg_match("/$last[1]/u", "аэоө") && 
				   preg_match("/^$s(ҕыт|ҕит|ҕут|ҕүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после ы, и, у, ү, й, л, р	-гыт (-гит, -гут, -гүт)
				if(preg_match("/$last[1]/u", "ыиуүйлр") && 
				   preg_match("/^$s(гыт|гит|гут|гүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после к, п, с, т		-кыт (-кит, -кут, күт)
				if(preg_match("/$last[1]/u", "кпст") && 
				   preg_match("/^$s(кыт|кит|кут|күт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после х			-хыт (-хит, -хут, хүт)
				if(preg_match("/$last[1]/u", "х") && 
				   preg_match("/^$s(хыт|хит|хут|хүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после м, н, ҥ		-ҥыт (-ҥит, -ҥут, -ҥүт)
				if(preg_match("/$last[1]/u", "мнҥ") && 
				   preg_match("/^$s(ҥыт|ҥит|ҥут|ҥүт)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					
					// после гласных, л		-лара (-лэрэ, -лоро, -лөрө)
				if((!$sogl || preg_match("/$last[1]/u", "л")) && 
				   preg_match("/^$s(лара|лэрэ|лоро|лөрө)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после к, п, с, х		-тара (-тэрэ, -торо, -төрө)
				if(preg_match("/$last[1]/u", "кпсх") && 
				   preg_match("/^$s(тара|тэрэ|торо|төрө)$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после й, р			-дара (-дэрэ, -доро, -дөрө)
				if(preg_match("/$last[1]/u", "йр") && 
				   preg_match("/^$s(дара|дэрэ|доро|дөрө))$/u", $word)) {$text = "$text<br>$buffer"; break; }
					// после м, н, ҥ		-нара (-нэрэ, -норо, -нөрө)
				if(preg_match("/$last[1]/u", "мнҥ") && 
				   preg_match("/^$s(нара|нэрэ|норо|нөрө)$/u", $word)) {$text = "$text<br>$buffer"; break; }


				// Совместный падеж
				$p = array('лыын', 'лиин', 'луун', 'лүүн',
					   'тыын', 'тиин', 'туун', 'түүн',
					   'дыын', 'диин', 'дуун', 'дүүн',
					   'ныын', 'ниин', 'нуун', 'нүүн',
					   
					   'быныын', 'пыныын', 'мыныын',
					   'ҕыныын', 'гыныын', 'кыныын', 'хыныын', 'ҥыныын',
					   'тыныын', 'ыныын',
					   'бытыныын', 'пытыныын', 'мытыныын',	
					   'ҕытыныын', 'гытыныын', 'кытыныын', 'хытыныын', 'ҥытыныын',
					   'ларыныын', 'тарыныын', 'дарыныын', 'нарыныын');
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Винительный падеж
					// после гласных -ны (-ни, -ну, нµ) 
					// после согласных –ы(-и, -у, -µ) 
				$p = array('бын', 'пын', 'мын',
					   'ҕын', 'гын', 'кын', 'хын', 'ҥын',
					   'тын', 'ын',
					   'бытын', 'пытын', 'мытын',
					   'ҕытыныын', 'гытыныын', 'кытыныын', 'хытыныын', 'ҥытыныын',
					   'ларын', 'тарын', 'дарын', 'нарын' );
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Частный падеж
				$p = array('та', 'то', 'тэ', 'тө', 
					   'да', 'до', 'дэ', 'дө', 
					   'ла', 'ло', 'лэ', 'лө', 
					   'на', 'но', 'нэ', 'нө',

					   'бына', 'пына', 'мына',
					   'ҕына', 'гына', 'кына', 'хына', 'ҥына',
					   'тына', 'ына',
					   'бытына', 'пытына', 'мытына',
					   'ҕытына', 'гытына', 'кытына', 'хытына', 'ҥытына',
					   'ларына', 'тарына', 'дарына', 'нарына');
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Дательный падеж
				$p = array('ҕа', 'ҕэ', 'ҕо', 'ҕө', 
					   'га', 'гэ', 'го', 'гө', 
					   'ка', 'кэ', 'ко', 'кө', 
					   'ха', 'хэ', 'хо', 'хө', 
					   'на', 'нэ', 'но', 'нө',

					   'бар', 'пар', 'мар',
					   'ҕар', 'гар', 'кар', 'хар', 'ҥар',
					   'тыныын', 'ыныын',
					   'бытыгар', 'пытыгар', 'мытыгар',
					   'ҕытыгар', 'гытыгар', 'кытыгар', 'хытыгар', 'ҥытыгар',
					   'ларыгар', 'тарыгар', 'дарыгар', 'нарыгар');
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Исходный падеж
					// после гласных –ттан (-ттэн, -ттон, -ттөн)
					// после согласных -тан (-тэн, -тон, -төн) 
				$p = array('быттан', 'пыттан', 'мыттан',
					   'ҕыттан', 'гыттан', 'кыттан', 'хыттан', 'ҥыттан',
					   'тыттан', 'ыттан',
					   'бытыттан', 'пытыттан', 'мытыттан',
					   'ҕытыттан', 'гытыттан', 'кытыттан', 'хытыттан', 'ҥытыттан',
					   'ларыттан', 'тарыттан', 'дарыттан', 'нарыттан');
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Орудный падеж
					// после гласных -нан (-нэн, -нөн, -нон) 
					// после согласных -ынан (-инэн, -унан, -үнэн)
					
				$p = array('бынан', 'пынан', 'мынан',
					   'ҕынан', 'гынан', 'кынан', 'хынан', 'ҥынан',
					   'тынан', 'ынан',
					   'бытынан', 'пытынан', 'мытынан',
					   'ҕытынан', 'гытынан', 'кытынан', 'хытынан', 'ҥытынан',
					   'ларынан', 'тарынан', 'дарынан', 'нарынан');
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Сравнительный падеж	
				$p = array('тааҕар', 'тээҕэр', 'тооҕор', 'төөҕөр', 
					   'лааҕар', 'лээҕэр', 'лооҕор', 'лөөҕөр', 
					   'нааҕар', 'нээҕэр', 'нооҕор', 'нөөҕөр',

					   'бынааҕар', 'пынааҕар', 'мынааҕар',	
					   'ҕынааҕар', 'гынааҕар', 'кынааҕар', 'хынааҕар', 'ҥынааҕар',
					   'тынааҕар', 'ынааҕар',
					   'бытынааҕар', 'пытынааҕар', 'мытынааҕар',
					   'ҕытынааҕар', 'гытынааҕар', 'кытынааҕар', 'хытынааҕар', 'ҥытынааҕар',	
					   'ларынааҕар', 'тарынааҕар', 'дарынааҕар', 'нарынааҕар');
				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
				// Падежная форма –лары
				$p = array('лары', 'лэри', 'лору', 'лөрү', 
					   'тары', 'тэри', 'тору', 'төрү', 
					   'дары', 'дэри', 'дору', 'дөрү', 
					   'нары', 'нэри', 'нору', 'нөрү');

				foreach($p as $k){
					if(preg_match("/^$s$k$/", $word)){
						$text = "$text<br>$buffer";
						$found = 1;
						break;
					}
				}
				if($found == 1) { break; }
			}
    		}
                if($text != "")
			echo "<tr><td>$text</td><td>$descr</td></tr>";
                fclose($fhandle);
        }
    }
    closedir($handle);
}
echo "</table>";
?>
