<script type="text/javascript" language="javascript">
    function do_onLoad(){}
</script>
<div class="authors_content">
		<table width="100%" border=0>
		<td width="160px">
			<img src="imgs/photos/zamorschikova.JPG" width="120px" height="150px" border="1"  alt="photo"/>
		</td>
		<td valign="top">
			<span class="FIO">Заморщикова Людмила Софроновна</span><br>
			<span class="who">Руководитель</span><br>
			<span class="degree">к.ф.н., доцент, зам.директора по научной работе ИЗФиР</span><br>
			<span class="email">lszam&nbsp;@&nbsp;mail.ru</span><br>
		</td>
		</table>		


		<table width="100%" border=0>
		<td width="160px">
			<img src="imgs/photos/borisova.JPG" width="120px" height="150px" border="1" alt="photo"/>
		</td>
		<td valign="top">
			<span class="FIO">Борисова Изабелла Захаровна</span><br>
			<span class="who">&nbsp;</span><br>
			<span class="degree">к.п.н., доцент, директор РЦ СВФУ</span><br>
			<span class="email">&nbsp;</span><br>
		</td>
		</table>		
		<table width="100%" border=0>
		<td width="160px">
			<img src="imgs/photos/Romanenko.png" width="120px" height="150px" border="1" alt="photo"/>
		</td>
		<td valign="top">
			<span class="FIO">Романенко Алексей Анатольевич</span><br>
			<span class="who">Автор системы. Техническое сопровождение</span><br>
			<span class="degree">к.т.н., зав. отделом компьютерной техники ФИТ НГУ</span><br>
                        <span class="email">arom&nbsp;@&nbsp;ccfit.nsu.ru</span><br>
		</td>
		</table>		
<!--
<h2>Информация о региональных участниках проекта</h2>

<p>   ...
-->
<!-- 
В <u>Новокузнецке</u> экспериментальная работа проводилась под руководством
кандидата педагогических наук, доцента кафедры английского языка и методики
преподавания (Кузбасская государственная педагогическая академия: КузГПА)
<b>Соколовой Ольги Витальевны</b> (ole426@yandex.ru). Эксперимент проводился в 2008
году. По окончании эксперимента ею представлено 600 анкет, все переведены в
электронный формат на месте и затем обработаны на кафедре истории и типологии
языков и культур ФИЯ НГУ. 
<p>    В <u>Омске</u> ответственный за проведение ассоциативного эксперимента доктор
филологических наук, доцент; профессор кафедры русского языка Омского
государственного университета им. Ф.М.Достоевского <b>Елена Николаевна Гуц</b>
(egoots@yandex.ru). Эксперимент проводился в 2008 году. Всего по окончании
эксперимента  было представлено 480 анкет в бумажном варианте. В НГУ они были
переведены в электронный формат и обработаны.
<p>     Ответственный за сбор информации в <u>Чите</u>: кандидат филологических наук,
доцент кафедры иностранных языков <b>Любовь Романовна Лаврентьева</b>
(lavrenteval@mail.ru) (Читинский государственный университет). Всего из этого
региона поступило 250 анкет. Все анкеты собраны в сентябре 2008 года. Позднее
они были переведены в электронный формат и обработаны в Новосибирске.
<p>      В <u>Хабаровске</u> эксперимент проводился под руководством старшего научного
сотрудника, кандидата филологических наук, доцента кафедры английской филологии
Дальневосточного государственного гуманитарного университета (ДВГГУ) <b>Юзефович
Натальи Григорьевны</b> (yuzefovich_2005@mail.ru). Эксперимент проводился в 2008
году. Ею собрано 473 анкеты, которые были переведены в электронный формат и
обработаны в НГУ.
<p>      В <u>Томске</u> и <u>Северске</u> эксперимент проводился с мая по сентябрь 2008 года.
Ответственные за его проведение и за первичную обработку данных: руководитель
группы: кандидат филологических наук, доцент кафедры английской филологии
факультета иностранных языков Томского государственного университета <b>Новицкая
Ирина Владимировна</b> (novitsky@mail.tomsknet.ru), в составе группы кандидат
филологических наук, доцент <b>Казанцева Татьяна Юрьевна</b> и преподаватель <b>Нагель
Ольга Васильевна</b>. Здесь собрано и переведено в электронный формат около 500
анкет (491 анкета после финальной обработки данных в НГУ).

-->

</div>
